{
  "title": "Getting Started",
  "cells": [
    {
      "type": "text",
      "data": "<div>Welcome to Quiver! This tutorial will help you get started.</div><div><br></div><div>Quiver is a note-taking app built for programmers. Its unique cell-based design lets you easily mix text and code within one note, edit code with an awesome code editor, and find any note instantly via the full-text search.</div>"
    },
    {
      "type": "text",
      "data": "<h3>Jump Right In</h3><div>If you want to start using Quiver right away, just remember one thing: <u>a note in Quiver is comprised of cells</u>. Cells are snippets of text or code that you can freely mix. You can even set different language modes for different code cells inside one note.</div><div><br></div><div>Click inside a new note and start typing. Press “shift+return” (⇧⏎) to create a new cell and use “backspace” to merge cells. That’s all you need to know to start using Quiver.&nbsp;</div><div><br></div><div>But if you want to learn more, keep reading.</div>"
    },
    {
      "type": "text",
      "data": "<h3>Cells</h3><div>Currently three types of cells are supported:</div><div><ol><li>A “Text Cell\" lets you edit rich-text in-place.</li><li>A “Code Cell” packs an awesome code editor, with syntax highlighting support for most languages.</li><li>A “Markdown Cell” lets you write in Markdown, with inline formatting and custom CSS options.</li></ol></div>"
    },
    {
      "type": "text",
      "data": "For example, this is a <b>text cell</b> with <i>some <u>formatting</u> applied</i>."
    },
    {
      "type": "text",
      "data": "You can change text styles by using the toolbar on top of this note, or use standard keyboard shortcuts, such as ⌘B for bold."
    },
    {
      "type": "text",
      "data": "More complex text and paragraph styles are also supported. You can find those options under the “Format” menu."
    },
    {
      "type": "text",
      "data": "<div style=\"text-align: center;\">This is <span style=\"font-size: 21px;\"><i>an example</i></span> of a <u><font face=\"Georgia\" style=\"font-size: 19px;\">text cell</font></u> with <font color=\"#c14dff\" style=\"\">complex styles</font> applied.</div>"
    },
    {
      "type": "text",
      "data": "A code cell packs the powerful ACE code editor, which supports syntax highlighting for most languages, over 20 themes, automatic indent and outdent, etc."
    },
    {
      "type": "code",
      "language": "javascript",
      "data": "// This is a code cell set to the JavaScript mode\n\nvoid hello()\n{\n    console.log(\"Hello World!\");\n}"
    },
    {
      "type": "code",
      "language": "coffee",
      "data": "# And this is a code cell set to the CoffeeScript mode\n\nhello = ->\n    console.log 'Hello World!'"
    },
    {
      "type": "markdown",
      "data": "\n## Markdown Cell\n\nThis is a markdown cell. You can use common markdown syntax here.\n\nBasic formatting of *italic* and **bold** is supported.\n\nSo is `inline code`.\n\nAnd lists.\n\n### Ordered list\n\n1. Item 1\n2. A second item\n3. Number 3\n4. Ⅳ\n\n### Unordered list\n\n* An item\n* Another item\n* Yet another item\n* And there's more...\n\n### Quote\n\n> Here is a quote.\n\nCustom CSS options can be set in the *Preferences* panel.\n"
    },
    {
      "type": "text",
      "data": "You can change the language mode in the toolbar above the note. You can set the default cell type in the Preferences panel."
    },
    {
      "type": "text",
      "data": "Sometimes you might want to convert one cell type to another. You can use the popup button in the toolbar to do that, or keyboard shortcuts (⌥⌘1 to convert to text cell, ⌥⌘2 to convert to code cell,&nbsp;⌥⌘3 to convert to markdown cell). You can find these options under the “Cell” menu, too."
    },
    {
      "type": "text",
      "data": "<h3>Cell Operations</h3><div>Cell operations in Quiver are very powerful, while intuitive to learn.</div><div><br></div><div>The most important one is to create a new cell, which you have already learned. Press “shift+return” (⇧⏎) to create a new cell below the current cell. The new cell is created in the text cell mode, but you can quickly convert it to a code cell if you want (tip: use keyboard shortcut ⌥⌘2).</div><div><br></div><div>Another important cell operation is to merge two cells. Simply place the cursor at the beginning of the second cell, then press the “backspace” key. <u>Note that you can’t merge cells of different types.</u></div><div><br></div><div>You can also cut, copy or paste a cell, split a cell, move a cell up or down. All these cell operations and their corresponding keyboard shortcuts can be found under the “Cell” menu.</div><div><br></div><div>To copy a code snippet to the clipboard, click inside the code cell, and press ⇧⌘C.</div>"
    }
  ]
}